In [1]:
import pandas as pd
import numpy as np

In [4]:
data = np.random.randn(4,3)

In [5]:
data

array([[-0.42183653, -1.29244528,  0.76578474],
       [-0.79629029, -0.66738657, -0.24823839],
       [-1.0171263 , -1.76325013,  0.74982254],
       [-0.75255227,  1.73344257, -0.11502011]])

In [6]:
dataFrame = pd.DataFrame(data)

In [7]:
type(dataFrame[0])

pandas.core.series.Series

In [8]:
dataFrame

          0         1         2
0 -0.421837 -1.292445  0.765785
1 -0.796290 -0.667387 -0.248238
2 -1.017126 -1.763250  0.749823
3 -0.752552  1.733443 -0.115020

In [9]:
yeniDataFrame = pd.DataFrame( data, index = ["Kubra","Zeynep","Meryem","Murat"],columns = ["Maas","Yas","Calisma Saati"])

In [10]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Kubra  -0.421837 -1.292445       0.765785
Zeynep -0.796290 -0.667387      -0.248238
Meryem -1.017126 -1.763250       0.749823
Murat  -0.752552  1.733443      -0.115020

In [11]:
yeniDataFrame["Yas"]

Kubra    -1.292445
Zeynep   -0.667387
Meryem   -1.763250
Murat     1.733443
Name: Yas, dtype: float64

In [12]:
yeniDataFrame[["Yas","Maas"]]

             Yas      Maas
Kubra  -1.292445 -0.421837
Zeynep -0.667387 -0.796290
Meryem -1.763250 -1.017126
Murat   1.733443 -0.752552

In [13]:
yeniDataFrame.loc["Zeynep"]

Maas            -0.796290
Yas             -0.667387
Calisma Saati   -0.248238
Name: Zeynep, dtype: float64

In [14]:
yeniDataFrame.iloc[1]

Maas            -0.796290
Yas             -0.667387
Calisma Saati   -0.248238
Name: Zeynep, dtype: float64

In [15]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [16]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Kubra  -0.421837 -1.292445       0.765785       -2.584891
Zeynep -0.796290 -0.667387      -0.248238       -1.334773
Meryem -1.017126 -1.763250       0.749823       -3.526500
Murat  -0.752552  1.733443      -0.115020        3.466885

In [17]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1)

            Maas       Yas  Calisma Saati
Kubra  -0.421837 -1.292445       0.765785
Zeynep -0.796290 -0.667387      -0.248238
Meryem -1.017126 -1.763250       0.749823
Murat  -0.752552  1.733443      -0.115020

In [18]:
yeniDataFrame.drop("Murat", axis = 0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Kubra  -0.421837 -1.292445       0.765785       -2.584891
Zeynep -0.796290 -0.667387      -0.248238       -1.334773
Meryem -1.017126 -1.763250       0.749823       -3.526500

In [19]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Kubra  -0.421837 -1.292445       0.765785       -2.584891
Zeynep -0.796290 -0.667387      -0.248238       -1.334773
Meryem -1.017126 -1.763250       0.749823       -3.526500
Murat  -0.752552  1.733443      -0.115020        3.466885

In [20]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace= True)

In [21]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Kubra  -0.421837 -1.292445       0.765785
Zeynep -0.796290 -0.667387      -0.248238
Meryem -1.017126 -1.763250       0.749823
Murat  -0.752552  1.733443      -0.115020

In [22]:
yeniDataFrame.loc["Kubra"]["Calisma Saati"]

0.7657847413461055

In [23]:
yeniDataFrame.loc["Kubra","Calisma Saati"]

0.7657847413461055

In [24]:
booleanFrame = yeniDataFrame < 0

In [25]:
booleanFrame

        Maas    Yas  Calisma Saati
Kubra   True   True          False
Zeynep  True   True           True
Meryem  True   True          False
Murat   True  False           True

In [26]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Kubra  -0.421837 -1.292445            NaN
Zeynep -0.796290 -0.667387      -0.248238
Meryem -1.017126 -1.763250            NaN
Murat  -0.752552       NaN      -0.115020

In [27]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

           Maas       Yas  Calisma Saati
Murat -0.752552  1.733443       -0.11502

In [28]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Kubra  -0.421837 -1.292445       0.765785
Zeynep -0.796290 -0.667387      -0.248238
Meryem -1.017126 -1.763250       0.749823
Murat  -0.752552  1.733443      -0.115020

In [29]:
yeniIndeksListesi = ["Kub","Zey","Mer","Mur"]

In [30]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [31]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Kubra  -0.421837 -1.292445       0.765785         Kub
Zeynep -0.796290 -0.667387      -0.248238         Zey
Meryem -1.017126 -1.763250       0.749823         Mer
Murat  -0.752552  1.733443      -0.115020         Mur

In [32]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Kub         -0.421837 -1.292445       0.765785
Zey         -0.796290 -0.667387      -0.248238
Mer         -1.017126 -1.763250       0.749823
Mur         -0.752552  1.733443      -0.115020

In [33]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Kubra  -0.421837 -1.292445       0.765785         Kub
Zeynep -0.796290 -0.667387      -0.248238         Zey
Meryem -1.017126 -1.763250       0.749823         Mer
Murat  -0.752552  1.733443      -0.115020         Mur

In [34]:
yeniDataFrame.set_index("Yeni Indeks",inplace=True)

In [35]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Kub         -0.421837 -1.292445       0.765785
Zey         -0.796290 -0.667387      -0.248238
Mer         -1.017126 -1.763250       0.749823
Mur         -0.752552  1.733443      -0.115020

In [27]:
ilkIndeksler = ["Tavsan","Tavsan","Tavsan","Avci","Avci","Avci"]

In [28]:
icIndeksler = ["bugs","bunny","bart","cartman","kenny","homer"]

In [29]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [30]:
birlesmisIndeks

[('Tavsan', 'bugs'),
 ('Tavsan', 'bunny'),
 ('Tavsan', 'bart'),
 ('Avci', 'cartman'),
 ('Avci', 'kenny'),
 ('Avci', 'homer')]

In [31]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [32]:
birlesmisIndeks

MultiIndex([('Tavsan',    'bugs'),
            ('Tavsan',   'bunny'),
            ('Tavsan',    'bart'),
            (  'Avci', 'cartman'),
            (  'Avci',   'kenny'),
            (  'Avci',   'homer')],
           )

In [33]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[50,"D"],[60,"E"],[9,"F"]]

In [34]:
cizgiFilmNumbyDizisi = np.array(benimCizgiFilmListem)

In [38]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumbyDizisi,index = birlesmisIndeks, columns = ["Yas","Meslek"])

In [39]:
cizgiFilmDataFrame

               Yas Meslek
Tavsan bugs     40      A
       bunny    10      B
       bart     30      C
Avci   cartman  50      D
       kenny    60      E
       homer     9      F

In [40]:
cizgiFilmDataFrame.loc["Tavsan"].loc["bunny"]

Yas       10
Meslek     B
Name: bunny, dtype: object

In [41]:
cizgiFilmDataFrame.index.names = ["Persona","Isim"]

In [42]:
cizgiFilmDataFrame

                Yas Meslek
Persona Isim
Tavsan  bugs     40      A
        bunny    10      B
        bart     30      C
Avci    cartman  50      D
        kenny    60      E
        homer     9      F